const board = [
    ["5", "3", "-", "-", "7", "-", "-", "-", "-"],
    ["6", "-", "-", "1", "9", "5", "-", "-", "-"],
    ["-", "9", "8", "-", "-", "-", "-", "6", "-"],
    ["8", "-", "-", "-", "6", "-", "-", "-", "3"],
    ["4", "-", "-", "8", "-", "3", "-", "-", "1"],
    ["7", "-", "-", "-", "2", "-", "-", "-", "6"],
    ["-", "6", "-", "-", "-", "-", "2", "8", "-"],
    ["-", "-", "-", "4", "1", "9", "-", "-", "5"],
    ["-", "-", "-", "-", "8", "-", "-", "7", "9"]
];

const size = 9; // Длина строки и столбца

// Проверка на пустоту r-столбец , c-строка 

let solveSudoku = function(board) {

    const findEmpty = (board) => {
        for (let r = 0; r < size; r++) {
            for (let c = 0; c < size; c++) {
                if(board[r][c] === '-') {
                    return [r, c]; // Возвращает координаты пустой ячейки
                }
            }
        }
        return null;
    }

    return findEmpty(board); // Возвращаем результат выполнения функции
};

console.log(solveSudoku(board)); // Вызов функции и вывод результата

